jeskick/KK.TRACK/receiver/pio/rx/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
# Console on schematic UART only: GPIO21 TX / GPIO20 RX (docs/HARDWARE.md), no USB-JTAG
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_TX_GPIO=21
CONFIG_ESP_CONSOLE_UART_RX_GPIO=20
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED=n

# Board has external TTL only; BLE RF cal can exceed 5s on single core
# PHY init data: use IDF built-in (partition mode needs separate phy_data.bin)
CONFIG_ESP_PHY_ENABLE_USB=n
CONFIG_ESP_TASK_WDT_CHECK_IDLE_TASK_CPU0=n

# PPM GPTimer ISR: GPIO/timer ctrl in IRAM (safe when BLE/NVS disables cache)
CONFIG_GPIO_CTRL_FUNC_IN_IRAM=y
CONFIG_GPTIMER_CTRL_FUNC_IN_IRAM=y
CONFIG_GPTIMER_ISR_IRAM_SAFE=y

# RX firmware ~1MB; use IDF default large single-app partition
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_LOG_DEFAULT_LEVEL_WARN=y

CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_CONTROLLER_ENABLED=y
CONFIG_BT_NIMBLE_MAX_CONNECTIONS=1
CONFIG_BT_NIMBLE_TASK_STACK_SIZE=8192
CONFIG_ESP_MAIN_TASK_STACK_SIZE=5120
CONFIG_ESP_SYSTEM_EVENT_TASK_STACK_SIZE=4096
CONFIG_BT_CTRL_DFT_TX_POWER_LEVEL_P6=y
CONFIG_BT_NIMBLE_ROLE_PERIPHERAL=y
CONFIG_BT_NIMBLE_ROLE_BROADCASTER=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=n
CONFIG_BT_NIMBLE_ROLE_OBSERVER=n
CONFIG_BT_NIMBLE_LL_CFG_FEAT_LE_ENCRYPTION=n
CONFIG_BT_NIMBLE_SECURITY_ENABLE=n

CONFIG_ESP_WIFI_ENABLED=y
CONFIG_HTTPD_MAX_URI_HANDLERS=8
